Конфигурация/Documents/ЗачислениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗачислениеПаев</Name>
			<BasedOn>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДолиПайщиковВИнвестиционномФонде</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНадбавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияПравилПаевогоИнвестиционногоФонда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисленияЧерезАгента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредназначенДляКвалИнвесторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыПриЧастичномПогашении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрокаОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаНадбавкиПриПриобретенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаСкидкиПриПогашенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндикаторДляОценкиРезультативностиУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БиржевыеИндексы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЗачислениеПаев/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
		
	Если Не ЗначениеЗаполнено(Объект.ПоступлениеДенежныхСредств) Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ВидЗаявки") = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Обмен") Тогда
			//Ищем погашение по заявке и подставляем его сумму
			Объект.Сумма = СуммаПогашенияПоОбменуПаев(Объект.Организация, Объект.Заявка);
		Иначе
			Объект.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "Сумма");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьСтоимостьПаяИПараметрыНадбавкиНаСервере();
	РассчитатьКоличествоПаевИСуммуНадбавки(Неопределено);
	
	ОбновитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	ОбновитьСтоимостьПаяИПараметрыНадбавкиНаСервере();
	РассчитатьКоличествоПаевИСуммуНадбавки(Неопределено);
	
	ОбновитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПаевойИнвестиционныйФондПриИзменении(Элемент)
	
	Объект.СчетДоверительногоУправления = ПолучитьСчетДоверительногоУправления(Объект.ПаевойИнвестиционныйФонд, Объект.Дата);
	Объект.ПоступлениеДенежныхСредств   = Неопределено;
    
	ОбновитьСтоимостьПаяИПараметрыНадбавкиНаСервере();
	РассчитатьКоличествоПаевИСуммуНадбавки(Неопределено);

	ОбновитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоПаевИСуммуНадбавки(Команда)
			
	Если ЭтаФорма.РасчетнаяСтоимостьПая <> 0 Тогда
		
		НадбавкаИКоличество = РаботаСДокументамиКлиентСервер.РассчитатьКоличествоПаевИСуммуНадбавки(
						Объект.Сумма,
						ЭтаФорма.РасчетнаяСтоимостьПая,
						Новый Структура("ПрименяютсяНадбавкиИСкидки, СтавкаНадбавки", ЭтаФорма.ПрименяетсяНадбавка, ЭтаФорма.СтавкаНадбавки));
				
		Объект.Количество		= НадбавкаИКоличество.Количество;
		Объект.СуммаНадбавки	= НадбавкаИКоличество.СуммаНадбавки;
					
	Иначе
		
		Объект.Количество 		= 0;
		Объект.СуммаНадбавки	= 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеДенежныхСредствПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПоступлениеДенежныхСредств) Тогда
		Объект.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПоступлениеДенежныхСредств, "Сумма");
	КонецЕсли;
	
	СуммаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	РассчитатьКоличествоПаевИСуммуНадбавки(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Объект.Дата, Объект.Организация.ЮрФизЛицо)));
		
	Элементы.ПаевойИнвестиционныйФонд.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
	ОбновитьСтоимостьПаяИПараметрыНадбавкиНаСервере();
	
	ОбновитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтоимостьПаяИПараметрыНадбавкиНаСервере()
	
	ДатаДокумента = ?(Объект.Дата = '00010101', ТекущаяДатаСеанса(), Объект.Дата);
		
	ДатаСтоимости = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(
						Объект.СчетДоверительногоУправления,						
						ДатаДокумента);
	СтоимостьПаяИзРегистра = РегистрыСведений.ФинансовыеПоказатели.РасчетнаяСтоимостьПаяНаДату(
								Объект.Организация, 
								Объект.СчетДоверительногоУправления, 
								ДатаСтоимости);
		
	ЭтаФорма.РасчетнаяСтоимостьПая 		= 0;
	ЭтаФорма.СтавкаНадбавки 			= 0;
	ЭтаФорма.ПрименяетсяНадбавка		= Ложь;
	ЭтаФорма.ДатаРасчетнойСтоимостиПая	= Неопределено;
		
	Если СтоимостьПаяИзРегистра <> Неопределено Тогда				
		ЭтаФорма.РасчетнаяСтоимостьПая		= СтоимостьПаяИзРегистра;	
		ЭтаФорма.ДатаРасчетнойСтоимостиПая	= ДатаСтоимости;		
	Иначе
		
		Если Объект.Количество <> 0 Тогда
			ЭтаФорма.РасчетнаяСтоимостьПая = Объект.Сумма / Объект.Количество;
		КонецЕсли;
				
	КонецЕсли;
	
	ПараметрыНадбавки = РегистрыСведений.УсловияПравилПаевогоИнвестиционногоФонда.ПараметрыРасчетаНадбавокИСкидок(Объект.ПаевойИнвестиционныйФонд, ДатаДокумента);
	
	ЭтоЗачислениеПоОбменуПаев = ЗначениеЗаполнено(Объект.Заявка) 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ВидЗаявки") = Перечисления.ВидыЗаявокПайщиков.Обмен;
		
	Если ПараметрыНадбавки <> Неопределено Тогда			
		ЭтаФорма.ПрименяетсяНадбавка	= ?(ЭтоЗачислениеПоОбменуПаев, Ложь, ПараметрыНадбавки.ПрименяютсяНадбавкиИСкидки);
		ЭтаФорма.СтавкаНадбавки			= ?(ЭтаФорма.ПрименяетсяНадбавка, ПараметрыНадбавки.СтавкаНадбавки, 0);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьИДоступность(Форма)
	
	Объект		= Форма.Объект;
	Элементы	= Форма.Элементы;
	
	ПрименяетсяНадбавка = Форма.ПрименяетсяНадбавка И Форма.СтавкаНадбавки <> 0;
	
	Элементы.ГруппаНадбавка.Видимость				= ПрименяетсяНадбавка;	
	Элементы.ДатаРасчетнойСтоимостиПая.Видимость	= ЗначениеЗаполнено(Форма.ДатаРасчетнойСтоимостиПая);
	
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();
						
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаНадбавка", "Объект.СуммаНадбавки");
				
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСчетДоверительногоУправления(Знач ПаевойИнвестиционныйФонд, Знач Период)
	
	Возврат Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд, Период);	
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммаПогашенияПоОбменуПаев(Организация, ЗаявкаПайщика)
	
	ДатаЗаявки = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаПайщика, "Дата"));
	
	// Погашение паев по обмену у другого счета ДУ
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК СуммаПогашения
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&Дата,
		|			,
		|			,
		|			Организация = &Организация
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками)
		|				И Основание = &ЗаявкаПайщика) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход > 0");
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ЗаявкаПайщика",	ЗаявкаПайщика);
	Запрос.УстановитьПараметр("Дата",			ДатаЗаявки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаПогашения;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найдено погашение паев по заявке на обмен паев %1", ЗаявкаПайщика), ЗаявкаПайщика);
		Возврат 0;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
